@echo off
echo ===============================================================================
echo = Lua 编译脚本由 EXP 编写，欢迎使用...                                  =
echo ===============================================================================
if not exist Output (
	mkdir Output
)
set LuaCount=0
for %%i in (*.lub) do (
	set /a LuaCount+=1
)
if %LuaCount% equ 0 (
	echo = 程序并未发现 SpyBin 的同级目录下存在 lua 文件需要编译...                =
)
for %%i in (*.lub) do (
	echo = 正在编译 %%i 到 Output\%%~ni.lub
	SpyBin\luac5.1.exe -o Output\%%~ni.lub %%i
	del %%i
)
echo ===============================================================================
echo = 编译过程已经执行完毕，再次感谢您的使用！                                    =
echo ===============================================================================
pause